{
  "version": "https://jsonfeed.org/version/1",
  "title": "Gadgets",
  "home_page_url": "https://gadgets.dopetrope.tk/",
  "feed_url": "https://gadgets.dopetrope.tk/feed.json",
  "description": "Technically Dope",
  "favicon": "https://gadgets.dopetrope.tk/assets/img/icons/favicon-96x96.png",
  "icon": "https://gadgets.dopetrope.tk/assets/icons/apple-touch-icon-114x114.png",
  "author": {
      "name": "Sudharshan TK",
      "url": "https://gadgets.dopetrope.tk/",
  },
  "expired": "false",
   "items": [
   	
    {
      "id": "21201846",
      "url": "https://gadgets.dopetrope.tk/the-poco-m2-pro-may-be-another-poco-smartphone-with-a-mid-range-processor/",
      "title": "The POCO M2 Pro may be another POCO smartphone with a mid-range processor",
      "content_html": "<p>Shortly after the launch of the POCO X2 earlier this year, we learned that a new POCO phone was in the works. However, we knew it to be a flagship device called the POCO F2 Pro which would essentially be a rebranded version of the Redmi K30 Pro. But we now have evidence to believe that the POCO F2 Pro isn’t the only device that the company is working on right now and it may soon launch another mid-range device.</p>\n\n<p>A new device, called the POCO M2 Pro, was recently spotted on the Mi India website, in the section where Xiaomi lists data from its SAR testing. The device has the model name “M2003J6CI” and,  according to an analysis conducted by XDA tipsters kacskrz and akhilnarang, the device has the code-name “gram.” Kacskrz has also spotted firmware for “gram_in_global”, which suggests that the phone will launch in India.  Interestingly, the code-name “gram” has previously appeared in the kernel source code for the Redmi Note 9 Pro and a watermark for “gram” has also appeared in the firmware for the Redmi Note 9 Pro.</p>\n\n<p>Since the Note 9 Pro is powered by the Qualcomm Snapdragon 720G, we suspect that the upcoming POCO M2 Pro may also feature the same SoC. However, we can’t be sure of this, since it’s possible that the device is running on a Qualcomm processor that’s software compatible with the Snapdragon 720G, which would also explain why references to “gram” appear in the Redmi Note 9 Pro’s kernel source code and firmware. What we can safely assume, however, is that this POCO M2 Pro may be a mid-range smartphone powered by a Snapdragon 7 series processor.</p>\n\n<p>It’s also worth mentioning that Xiaomi has since removed all mention of the POCO M2 Pro from the website, but you can still see the listing in an archived version of the page.</p>\n\n<p>These certification listings confirm the existence of the POCO M2 Pro along with its model number, affirming the previous information we reported on the device. Unfortunately, there’s not a whole lot to learn about the device beyond this information. We’ll keep you posted when we find out more.</p>\n",
      "summary": "POCO M2 Pro spotted on certification websites",
      "tags":  [ "Xiaomi","poco m2","mid-range" ],
      "date_published": "2020-05-21T18:46:00+05:30"
    },

    {
      "id": "21201837",
      "url": "https://gadgets.dopetrope.tk/realme-x50-pro-5g-review-value-flagship-smartphone-for-2020/",
      "title": "Realme X50 Pro 5G Review – Value Flagship Smartphone for 2020",
      "content_html": "<p>The smartphone market has taken many unexpected turns in 2020 – and that’s without getting into any of the ramifications of the currently-ongoing worldwide COVID-19 pandemic. We’ve seen the advent of the Qualcomm Snapdragon 865 and the adoption of 5G drive flagship smartphone prices sky-high, with the most recent additions to the OnePlus lineup continuing the trend of an upwardly increasing starting price. On top of that, we’ve seen rumors that the Google Pixel 5 may be the first in the company’s lineup to not feature the latest flagship chipset from Qualcomm.</p>\n\n<p>The higher cost of flagship smartphones in 2020 and an aversion to using the Snapdragon 865 may come as a result of an increased price by Qualcomm, as the Snapdragon 865 is a 5G-ready chipset. As a result, there are very few proper budget-oriented flagship smartphones on the market. The Realme X50 Pro 5G is one such device, though it’s incredibly hard to track down. I’ve had the pleasure of using it for the past month, though issues with my handset meant that I needed a replacement and this review ended up delayed. Pretty much everything that I found in my hands-on with the device has remained the same, with other aspects getting even better.</p>\n\n<h4 id=\"realme-x50-pro-5g-design\">Realme X50 Pro 5G Design</h4>\n\n<p>The Realme X50 Pro 5G features a rather typical smartphone design – the bezel-less display, curved glass back, no headphone jack… it’s a 2020 smartphone through and through. Its uniqueness lies in the front-facing camera, a dual-camera setup that results in a longer-than-usual cut-out on the top left of the display. It takes some getting used to, but it doesn’t really impede device usage too much. It’s quite a thick phone and has a lot of weight in it as well – both of which are thanks to the phone’s 5G capabilities. 5G phones are typically thicker, as they require both a bigger battery and more antennae for greater cell reception. It comes in at 205 grams, with much of the weight centered towards the bottom half.</p>\n\n<p>The Realme X50 Pro 5G has a single bottom-firing speaker at the bottom, alongside a front-facing speaker at the top of the display which also acts as the call speaker. Our unit is the Rust Red variant, though there is a Moss Green one too. It’s a frosted glass on the back, though there is no wireless charging. In other words, be careful not to drop it as the back is just as fragile as the front. The cameras on the back exponentially distance themselves from each other vertically, and in line with the camera sensor further down the body of the phone is a “realme” logo.</p>\n\n<h4 id=\"realme-x50-pro-5g-display\">Realme X50 Pro 5G Display</h4>\n\n<p>The display on the Realme X50 Pro 5G is one of its primary selling points. A 1080p 90Hz Super AMOLED panel at a 20:9 aspect ratio makes this device a decent contender against the best. Sure the OPPO Find X2 Pro, Samsung Galaxy S20 series, and the OnePlus 8 series sport 120Hz panels, but the difference from 90Hz to 120Hz is a lot less pronounced than the jump from 60Hz to 90Hz. It’s still noticeable, but the fluidity of 90Hz is a fairly decent compromise when considering that you are spending lesser. To put it in perspective – the time between each frame on a 90Hz screen is 11.1ms. On a 120Hz display, it’s 8.3 ms. With a 60Hz display, the time between each frame is 16.67 ms. There are hugely diminishing returns with the more frames you push on a display, and there comes a point where it may be worth spending significantly less for a rather insignificant difference in refresh rate.</p>\n\n<p>Aside from that, the Realme X50 Pro 5G has a pretty standard display. The screen comes in at 6.44-inches, and as already mentioned, is full HD in resolution. It’s a 100% DCI-P3 compliant, though there’s no support for HDR or content interpolation up to 90FPS (unlike in the case of the OPPO Find X2 Pro or the OnePlus 8 Pro).  It can get up to 1000 nits in brightness and looks good outdoors – even when it’s sunny. There’s a pre-applied screen protector too, and it’s definitely not the worst I’ve seen. I’ve left it on my device.</p>\n\n<p>My only criticism of the display is that the camera cut-out can be annoying when playing games. In the case of the OnePlus 8 Pro or the OPPO Find X2 Pro, the small camera cutout is easy to glide over with your thumb when playing games. Because of the size of the Realme X50 Pro’s cutout, however, I found it interfering with touch input at times. It is also a lot more noticeable while consuming full-screen content. The cut-out camera does make the status bar quite big as well, though not much bigger than I’m used to having come from the OnePlus 8 Pro and the OPPO Find X2 Pro.</p>\n\n<h4 id=\"realme-x50-pro-5g-performance\">Realme X50 Pro 5G: Performance</h4>\n\n<p>The Realme X50 Pro 5G packs the Qualcomm Snapdragon 865 and was one of the first devices on the market to do so. The Qualcomm Snapdragon 865 is the current flagship chipset from Qualcomm, and as such, it’s pretty much at par with the best performance that you’ll get on any Android smartphone currently. Qualcomm says that the Snapdragon 865 offers 25% greater performance than the Snapdragon 855, or 25% greater power efficiency when offering the same performance as its predecessor. The Adreno 650 GPU follows a similar approach – 20% faster graphics rendering or 35% more efficient graphics rendering when compared to the Adreno 640. The Realme X50 Pro 5G was the first device I’ve found to be fully capable of emulating GameCube games to near perfection – The Simpsons: Hit &amp; Run, a childhood favorite of mine, ran more or less without a hitch. As you may expect, pretty much any other game you can throw at the device from the Google Play Store will run perfectly as well.</p>\n",
      "summary": "its uniqueness lies in the front-facing camera",
      "tags":  [ "Realme","Flagship" ],
      "date_published": "2020-05-21T18:37:00+05:30"
    },

    {
      "id": "28201559",
      "url": "https://gadgets.dopetrope.tk/welcome-to-gadgets-by-dopetrope/",
      "title": "Welcome to Gadgets by Dopetrope",
      "content_html": "<h5 id=\"about-gadgets-by-dopetrope\">About - Gadgets by Dopetrope</h5>\n\n<p><strong>*Gadgets by Dopetrope</strong> is a ambitious Project Found For Sharing Tech News and Updates from various Tech Sources and Blogs.*</p>\n\n<p><strong>*Gadgets by Dopetrope</strong> Posts Various News From Popular Sources and it is constantly improving in terms of Technical Competence and also in terms of Content Quality. Currently dopetrope is Posting various News from various Sources. It is Also Constantly Improving in terms of Providing Original Content*</p>\n\n<p><em>The latest tech news about the world’s best (and sometimes worst) hardware, apps, and much more. From top companies like Google and Apple to tiny startups vying for your attention, R/W Tech has the latest in what matters in technology daily.</em></p>\n\n<p><em>Please Do Support the Original Content Creator and Also my Website</em></p>\n\n<h5 id=\"about-our-parent-group\">About our Parent Group</h5>\n\n<p>Independent. Irreverent. Intelligent. Infozy delivers sharp opinion in the arena of politics, pop-culture and power. Always skeptical but never cynical,Infozy is a Non-profit, Community driven, independent digital media Group, which leverages data and innovation to reach people globally.</p>\n\n<p>Infozy Website - <a href=\"https://infozy.tk\">Click Here</a></p>\n",
      "summary": "A Spin-off Website from Dopetrope for Gadget News",
      "tags":  [ "welcome message","dopetrope","gadgets" ],
      "date_published": "2020-04-28T15:59:00+05:30"
    }

  ]
}